tf-controller plan output:

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # b2_application_key.postgres-backup-keys["funkwhale"] will be created
  + resource "b2_application_key" "postgres-backup-keys" {
      + application_key    = (sensitive value)
      + application_key_id = (known after apply)
      + bucket_id          = "f7e5bfe6236a6754897b0912"
      + capabilities       = [
          + "deleteFiles",
          + "listAllBucketNames",
          + "listBuckets",
          + "listFiles",
          + "readFiles",
          + "writeFiles",
        ]
      + id                 = (known after apply)
      + key_name           = "postgres-backup-funkwhale"
      + name_prefix        = "postgres/funkwhale"
      + options            = (known after apply)
    }

  # kubernetes_secret.postgres-backup-bucket["funkwhale"] will be created
  + resource "kubernetes_secret" "postgres-backup-bucket" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "cnpg.io/reload" = "true"
            }
          + name             = "postgres-backups-bucket"
          + namespace        = "funkwhale"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

To apply this plan, please **merge** this pull request.
